StrathbogieBrewing/megate-archive/hardware/switch/avr/boards.txt
switch.name=Switch

switch.build.mcu=atmega8
switch.build.f_cpu=8000000L
switch.build.board=AVR_NG
switch.build.core=switch
switch.build.variant=switch

switch.upload.maximum_size=7680
switch.upload.maximum_data_size=1024
switch.upload.tool=arduino:avrdude
switch.upload.speed=19200
switch.upload.protocol=avr109
switch.upload.params.quiet=-q



